<template>
  <view class="privacy-policy" :selectable="true">
    <view>版本更新日期：2021年11月30日 </view>
    <view>版本生效日期：2021年11月30日</view>
    <view>
      四川潭州教育科技有限公司为我司湖南潭州教育网络科技有限公司的全资子公司，四川潭州教育科技有限公司作为Get一下app的拥有者，同意把Get一下app的全部运营权授权给湖南潭州教育网络科技有限公司。
    </view>
    <view>
      湖南潭州教育网络科技有限公司及其关联方（简称"公司"）作为Get一下app的运营者，深知个人信息对您的重要性，我们将按照法律法规的规定，保护您的个人信息及隐私安全。我们制定本"隐私政策"并特别提示：希望您在使用Get一下及相关服务前仔细阅读并理解本隐私政策，以便做出适当的选择。
    </view>
    <view>
      Get一下app（以下或称“我们”）注重保护用户个人信息及个人隐私。本隐私政策解释了用户（“您”）个人信息收集（以下或称“信息”）和使用的有关情况，本隐私政策适用于Get一下向您提供的所有相关服务（包括但不限于电子商务、网络社交等服务，以下称“Get一下服务”或“服务”）， 建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。如果您不同意本隐私政策的任何内容，您应立即停止使用Get一下服务。当您使用Get一下提供的任一服务时，即表示您已同意我们按照本隐私政策来合法使用和保护您的个人信息。
    </view>
    <view>
      本隐私政策将帮助您了解一下内容：
    </view>
    <view>一、个人信息收集</view>
    <view>二、我们对您个人信息的管理和使用</view>
    <view>三、您个人信息的分享</view>
    <view>四、您个人信息的安全</view>
    <view>五、访问和更新您的个人信息</view>
    <view>六、Cookie 及其它同类技术的使用</view>
    <view>七、未成年人的个人信息保护</view>
    <view>八、通知和修订 </view>

    <view>一、您个人信息的收集 </view>
    <view>1、收集使用您个人信息的目的</view>
    <view
      >我们收集信息是为了向您提供更好以及更个性化的服务，提高您使用Get一下提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，最终提高您的用户体验。</view
    >
    <view>2、收集使用您个人信息的方式</view>
    <view>（1）当您注册Get一下账户及您在使用相关Get一下服务时主动填写、提交及/或其他任何方式提供信息；</view>
    <view>（2）在您访问Get一下网站或使用Get一下服务时，主动授权或开启权限后由系统自动接收并记录信息。</view>
    <view
      >3、收集使用您个人信息的范围
      为了向您提供更好以及更个性化的服务，并努力提高您的用户体验，我们收集信息的种类如下：</view
    >
    <view>（1）您向我们提供的信息</view>
    <view
      >当您注册Get一下账户及您在使用相关Get一下服务时填写、提交及/或其他任何方式提供的信息，包括您的姓名、性别、出生年月日、身份证号码、电话号码、电子邮箱、收货地址、微信、微博、QQ等社交账号、及相关附加信息（如您地址中的所在的省份和城市、邮政编码等）。您可以选择不提供某一或某些信息，但是这样可能使您无法使用Get一下的许多特色服务。请您理解，我们使用您提供的信息是为了回应您的要求，为您在Get一下学习或享受服务提供便利，完善Get一下网站以及与您进行信息沟通。另外，我们可能会将您所提供的信息与您的Get一下账户关联，用以识别您的身份。</view
    >
    <view>（2）我们在您使用服务过程中获得的信息</view>
    <view>为了提高服务质量和用户体验，我们会留存您使用服务以及使用方式的相关信息，这类信息包括：</view>
    <view
      >a、您的浏览器和计算机上的信息。在您访问Get一下网站或使用Get一下服务时，Get一下系统自动接收并记录的您的浏览器和计算机上的信息（包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据）。</view
    >
    <view
      >b、您的位置信息。当您下载或使用Get一下、其关联方及合作伙伴开发的应用程序（例如Get一下APP），或访问移动网页使用Get一下服务时，Get一下可能会读取您的位置（大多数移动设备将允许您关闭定位服务，具体建议您联系您的移动设备的服务商或生产商）。</view
    >
    <view
      >c、您的设备信息。Get一下可能会读取您访问Get一下或使用Get一下服务时所使用的终端设备的信息，包括但不限于设备型号、设备识别码、操作系统、分辨率、电信运营商等。</view
    >
    <view
      >d、您的日历信息。Get一下基于日历的服务：在您开启我们可读取/写入您日历的权限后，我们将收集您的日历信息用于向您提供课程上课时间等相关记录及提醒。</view
    >
    <view
      >e、您的相机/摄像头的服务。Get一下基于相机/相册（图片库/视频库）的图片/视频访问及上传的服务：您可在开启相册权限后使用该功能上传您的照片/图片，以实现更换头像、发表动态、帖子、问答等功能。</view
    >
    <view
      >f、您的麦克风服务。Get一下基于麦克风的语音技术相关服务：您可在开启麦克风权限后使用麦克风实现录音功能，在这些功能中我们会收集您的录音内容来完成您的学习等需求。</view
    >
    <view
      >g、您的短信服务。Get一下基于用户安装并主动授权后,我们会向系统申请“读取短信”权限，为您提供更为便捷的短信快捷登录服务，通过识别短信中验证码信息，为您提供快捷的登录服务。</view
    >
    <view
      >h、您的行为或交易信息。Get一下可能会记录您访问Get一下或使用Get一下服务时所进行的操作以及您在Get一下网站上进行交易的相关信息。</view
    >
    <view>
      i、您的软件安装列表。Get一下可能会获取获取您的软件安装列表。
    </view>
    <view>
      j、除上述信息外，我们还可能为了提供服务及改进服务质量的合理需要而获得的您的其他信息，包括您与我们的客服团队联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息，以及您与Get一下的关联方、Get一下合作伙伴之间互动时我们获得的相关信息。同时，为提高您使用Get一下提供的服务的安全性，更准确地预防钓鱼网站欺诈和木马病毒，我们可能会通过了解一些您的网络使用习惯、您常用的软件信息等手段来判断您账户的风险，并可能会记录一些我们认为有风险的链接（“URL”）。</view
    >
    <view>（3）来自第三方的信息</view>
    <view
      >指在您注册Get一下账户和使用服务过程中，您授权Get一下可向Get一下的关联方、合作伙伴获取其所收集的相关信息。这些信息包括但不限于您的身份信息、行为信息、交易信息、设备信息等，Get一下会将此类信息汇总，用于帮助Get一下向您提供更好以及更加个性化的服务或更好的预防互联网欺诈。</view
    >
    <view>（4）您了解并同意，以下信息不适用本隐私政策：</view>
    <view>a、您在使用Get一下提供的搜索服务时输入的关键字信息；</view>
    <view>b、信用评价、违反法律法规规定或违反Get一下平台规则行为及Get一下已对您采取的措施；</view>
    <view>c、应法律法规要求需公示的企业名称等相关工商注册信息以及自然人经营者的信息。</view>
    <view
      >d、其他您与Get一下或Get一下的关联方所签署的协议（包括在线签署的电子协议，例如《Get一下用户注册协议》）以及Get一下平台规则中明确约定或提示您不适用本隐私政策的与您有关的信息。</view
    >
    <view> 二、我们对您个人信息的管理和使用</view>
    <view
      >为向您提供服务、提升我们的服务质量以及优化您的服务体验，我们会在符合法律规定下使用您的个人信息，并主要用于下列用途：</view
    >
    <view> 1、向您提供您使用的各项服务，并维护、改进这些服务。 </view>

    <br />服务如下：
    <br />a、AI算法优化服务：当您使用相机拍照和图片修图功能时，我们会采用无他人脸点数据技术收集您的皮肤和五官参数，这是为了实现AI算法优化，更准确快速反馈检测报告，使用次数越多，AI算法优化效果越好。这类信息是为提供本服务必须收集的信息，收集后即作去标识化处理，不会用于识别任何特定的用户。
    <br />b、IOS人脸优化处理效果：我们的服务可能会利用iOS的TrueDepth应用程序接口中人脸映像深度相关资讯运算结果，以达到更好的人脸映像处理效果；在此期间，我们既不会将该等运算结果用于其他目的，也不会以记录为目的或以其他方式搜集您的脸部映像深度为目的，撷取档案中的任何资料或上传资料到服务器，也不会与任何第三方共享。
    <br />c、推送通知服务：为了向您及时推送我们平台的相关消息，获得更好的用户体验，我们使用了极光SDK、小米SDK、
    oppoSDK，如您使用小米、华为、OPPO、VIVO、苹果手机，我们接入的上述手机厂商Push
    SDK，这些SDK需要获取您的手机终端唯一标识信息，并可能会收集您的手机型号、系统类型、系统版本、设备屏幕尺寸参数、网络权限并使用检索当前运行程序功能用于实现APP推送服务。如您不希望收到这些推送消息，您可点开手机内的【设置】-【Get一下】-【通知】点击关闭，关闭接收此类信息推送。

    <view>
      2、向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息，或通过系统向您展示个性化的第三方推广信息，或在征得您同意的情况下与Get一下的合作伙伴共享信息以便他们向您发送有关其产品和服务的信息。如您不希望接收上述信息，可通过相应的退订功能进行退订。</view
    >
    <view>
      3、我们可能使用您的个人信息以验证身份、预防、发现、调查欺诈、危害安全、非法或违反与我们或其关联方协议、政策或规则的行为，以保护您、其他Get一下用户，或我们或其关联方的合法权益。</view
    >
    <view>
      4、我们可能会将来自某项服务的个人信息与来自其他服务所获得的信息结合起来，用于为了给您提供更加个性化的服务使用，例如为让您通过购物拥有更广泛的社交圈而使用、共享或披露您的信息。</view
    >
    <view
      >5、我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，以展示我们的产品或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。</view
    >
    <view>6、让您参与有关我们产品及服务的调查。</view>
    <view>7、经您同意或授权的其他用途。</view>
    <view>三、您个人信息的分享</view>
    <view
      >您的个人信息是我们为您提供服务的重要部分，我们会遵循法律规定对您的信息承担保密义务。除以下情形外，我们不会将您的个人信息披露给第三方：</view
    >
    <view>1、征得您的同意或授权。</view>
    <view>2、根据法律法规的规定或行政或司法机构的要求。</view>
    <view
      >3、出于实现“我们对您个人信息的管理和使用”部分所述目的，或为履行我们在《Get一下用户注册协议》或本隐私政策中的义务和行使我们的权利，向Get一下的关联方、合作伙伴或代表Get一下履行某项职能的第三方（例如代表我们发出推送通知的通讯服务商）分享您的个人信息。</view
    >
    <view>4、如您是知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能产生的权利纠纷。</view>
    <view>5、只有共享您的信息，才能提供您需要的服务，或处理您与他人的纠纷或争议。</view>
    <view
      >6、与授权合作伙伴共享；在法律法规允许的范围内，为维护Get一下的合作伙伴、您或其他Get一下的用户或者社会公益、财产或安全遭受损害，我们仅为实现本隐私协议中声明的目的与授权合同伙伴提供某些服务。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们会仅出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们将审慎评估合作方使用共享信息的目的，对合作方的安全保障能力进行综合评估，我们会对合作方获取信息的软件工具开发包
      <!-- （<text
        class="btn"
        @click="goSdk"
      >
        点击查看SDK详情</text
      >） -->
      、应用接口(API)进行严格的安全检测，以保护数据安全。我们已与合作方签订合同明确双方的义务与责任，明确我们的合作伙伴无权将共享的个人信息用与其他用途。对于无法签订合同的合作方在使用过程中对用户造成影响的，Get一下将承担全部责任。</view
    >
    <view>
      以下是第三方SDK详情：
    </view>
    <!-- 第三方SDK详情 -->
    <view class="sdk-detail">
      <h3 class="h3">第三方SDK目录（Android）</h3>
      <view class="line"></view>
      <dl>
        <dt>名称：Bugly</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：数据统计分析</dt>
        <dt>
          隐私协议地址：<a href="https://static.bugly.qq.com/bugly-sdk-privacy-statement.pdf"
            >https://static.bugly.qq.com/bugly-sdk-privacy-statement.pdf</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：中国联通一键登录SDK</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：一键登录</dt>
        <dt>
          隐私协议地址：<a href="https://opencloud.wostore.cn/authz/resource/html/disclaimer.html?fromsdk=true"
            >https://opencloud.wostore.cn/authz/resource/html/disclaimer.html?fromsdk=true</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：OPPO Push</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：推送服务</dt>
        <dt>
          隐私协议地址：<a href="https://security.oppo.com/cn/privacydetails"
            >https://security.oppo.com/cn/privacydetails</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：Vivo Push</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：推送服务</dt>
        <dt>
          隐私协议地址：<a href="https://www.vivo.com.cn/about-vivo/privacy-policy"
            >https://www.vivo.com.cn/about-vivo/privacy-policy</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：小米 Push</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：推送服务</dt>
        <dt>
          隐私协议地址：<a href="https://dev.mi.com/console/doc/detail?pId=1822"
            >https://dev.mi.com/console/doc/detail?pId=1822</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：华为 Push</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：推送服务</dt>
        <dt>
          隐私协议地址：<a href="https://consumer.huawei.com/cn/privacy/privacy-policy"
            >https://consumer.huawei.com/cn/privacy/privacy-policy</a
          >
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：极光 Push</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址、已安装包名列表</dt>
        <dt>目的：推送服务</dt>
        <dt>
          隐私协议地址：<a href="https://www.jiguang.cn/license/privacy">https://www.jiguang.cn/license/privacy</a>
        </dt>
      </dl>
      <view class="line"></view>
      <dl>
        <dt>名称：友盟</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：数据统计分析</dt>
        <dt>隐私协议地址：<a href="https://www.umeng.com/page/policy">https://www.umeng.com/page/policy</a></dt>
      </dl>

      <view class="line"></view>
      <dl>
        <dt>名称：腾讯sdk</dt>
        <dt>手机用户信息类型：品牌、型号、IMEI、手机号、网络连接、IP、MAC地址</dt>
        <dt>目的：用于拍摄美化</dt>
        <dt>
          隐私协议地址：<a href="https://cloud.tencent.com/document/product/301/1967?from=copy"
            >https://cloud.tencent.com/document/product/301/1967?from=copy</a
          >
        </dt>
      </dl>
    </view>
    <view
      >7、您出现违反中国有关法律、法规规定或者违反您与Get一下签署的相关协议（包括在线签署的电子协议）或违反相关Get一下平台规则时需要向第三方披露的情形。</view
    >
    <view>8、为维护Get一下及其关联方或其他Get一下用户的合法权益。</view>
    <view
      >随着我们业务的发展，我们及我们的关联方有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移。我们将在转移前通知您。</view
    >
    <view>四、您个人信息的安全保护</view>
    <view
      >Get一下严格保护您的个人信息安全。我们使用各种制度、安全技术和程序等措施来保护您的个人信息不被未经授权的访问、篡改、披露或破坏。如果您对我们的个人信息保护有任何疑问，请联系我们的官方客服。</view
    >
    <view
      >在通过Get一下网站与第三方进行网上商品或服务的交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者社交账号等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是你的账户及密码发生泄露，请您立即联络我们，以便我们采取相应措施。</view
    >
    <view>
      请您注意，在您的个人信息超出保留期间后，我们会根据适用法律的要求删除您的个人信息或匿名化处理；您可以在我们的产品中直接申请注销账户。您可通过以下方式自行操作：您可以登陆移动端，我的-设置-账号安全，点击“注销账号”。您注销账户后，我们将停止为您提供产品与服务，并依据您的要求，除法律法规另有规定外，我们将删除您的个人信息。
    </view>
    <view>
      注销账号说明：
      您有权注销您的账号,可以通过在线操作来注销您的账号。当您注销账号后，您将无法再以该账号登录和使用我们的产品与服务；且该账号在Get一下及旗下的其他产品与服务使用期间已产生的但未消耗完毕的权益及未来的逾期利益等全部权益将被清除；该账号下的内容、信息、数据、记录等将会被删除；Get一下账号注销完成后，将无法恢复。
      如您在谨慎考虑后仍执意决定注销您的Get一下账号的，您可以在您使用的我们的产品与/或服务的相关功能设置页面或根据操作指引进行注销，Get一下APP的注销路径为：“我的—设置—账号与安全-注销账户”。填写验证码点击“注销账号”按钮后，账号注销即时生效。
    </view>
    <view>五、访问和更新您的个人信息</view>
    <view
      >您可以在“用户中心”页面的“个人信息”菜单中查阅您提交给Get一下的所有个人信息，你也可通过上述途径更新其他个人信息。
    </view>
    <!-- <view>六、注销账号 </view>
    <view>您随时可以注销此前注册的账号，在账户注销后，原账户相关信息会被清空且无法找回且无法进行以下操作:</view>
    <view>(1)账号中的个人信息、历史信息、书架记录等将被清空;</view>
    <view> (2)账号中的权益将被取消，已购买会员产品将视为自动放弃;</view>
    <view>(3)账号中的邀请好友关系将被清空; </view>
    <view>(4)账号中的签到记录将被清空;</view>
    <view> (5)账号中的金币余额、现金余额、书币、书券将被清空;</view>
    <view>在以下情形中，按照法律法规要求，我公司无法响应您的请求:</view>
    <view>(1) 与国家安全、国防安全直接相关的; </view>
    <view>(2)与公共安全、公共卫生、重大公共利益直接相关的;</view>
    <view>(3)与犯罪侦查、起诉、审判和判决执行等执行相关的; </view>
    <view>(4)有充分证据表明您存在主观恶意或滥用权力的;</view>
    <view>(5)响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的; </view>
    <view>(6)涉及商业秘密的。 注销操作 点击“我的"，点击"我的设置"，点击“账号注销"，点击"确认注销"。</view> -->
    <view>六、Cookie 及其它同类技术的使用</view>
    <view>1、Cookie的使用</view>
    <view>
      Cookie是由网页服务器存放在您的访问设备上的文本文件。指定给您的Cookie 是唯一的，它只能被将Cookie发布给您的域中的Web服务器读取。</view
    >
    <view
      >Get一下使用 Cookie 来帮助您实现您的联机体验的个性化，使您在Get一下及其关联方获得更轻松的访问体验。例如，Cookie 会帮助您在后续访问Get一下网站时调用您的信息，简化记录您填写个人信息（例如一键登录等）的流程；为您提供安全购物的偏好设置；帮助您优化对广告的选择与互动；保护您的数据安全等。</view
    >
    <view
      >您有权接受或拒绝 Cookie。大多数浏览器会自动接受Cookie，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookie。如果选择拒绝 Cookie，那么您可能无法完全体验所访问的Get一下网站或某些服务的全部功能。</view
    >
    <view>2、 网站信标和像素标签</view>
    <view
      >除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，Get一下向您发送的短信、电子邮件可能含有链接至Get一下网站内容的点击 URL。如果您点击该链接，Get一下则会跟踪此次点击，帮助我们了解您的产品和服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知推送的链接信息是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从Get一下的寄信名单中退订。</view
    >

    <view>七、你的权利</view>

    <view>
      我们非常重视你对个人信息的管理，并尽全力保护你对于你个人信息的查询、访问、修改、删除、撤回同意授权、注销账号、投诉举报以及设置隐私功能等权利，以使你拥有充分的能力保障你的隐私和安全。
    </view>
    <view>
      （一）访问、删除、更正你的个人信息 你可以通过以下方式管理你的信息：
      1. 查询访问、更正、取消你关注账号、粉丝、黑名单；
      （1）进入本APP—点击头像—点击“关注”可以访问关注账号，你也可以取消关注；
      （2）进入本APP—点击“搜索”可查询想要查找的用户信息。 （3）通过“黑名单”进行查看访问，并可自行“移出”黑名单。
      2. 访问个人账号信息：
      你可以查询、访问、更正你的头像、用户名、个人介绍、性别、生日、地区、个性签名等基本信息（身份证个人信息除外），也可以更改你的密码，你可以在本APP的“编辑资料”中进行查询、访问、更正。
    </view>
    <view>
      （二）自主选择控制个性化推荐信息
      我们的相关信息推荐等功能可能会根据信息系统、算法等在内的非人工自动决策机制做出，当你对我们推送的信息不感兴趣或希望减少某些信息推荐时，你可以通过设置“勿扰“拒绝消息的推送。
    </view>
    <view>
      （三）改变你授权同意范围或撤销授权 1. 改变或撤回敏感信息权限
      你可以通过的本APP中删除信息、更改隐私设置以及在设备本身操作系统中关闭通知、相册、摄像头、麦克风等权限改变同意范围或撤回你的授权。
      2. 拒绝接受推送及营销信息 你可以通过设置“勿扰“拒绝消息的推送。
      请你理解，特定的业务功能和服务将需要你的信息才能得以完成，当你撤回同意或授权后，我们无法继续为你提供撤回同意或授权所对应的功能和服务，也不再处理你相应的个人信息。但你撤回同意或授权的决定，不会影响公司此前基于你的授权而开展的个人信息处理。
    </view>

    <view>
      （四）投诉举报
      你可按照我们公示的制度进行投诉或举报。如果你认为你的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索（例如：认为我们收集你的个人信息违反法律规定或者双方约定），你可以通过点击“举报”，我们核查后会及时反馈你的投诉与举报。
    </view>
    <view>
      （五）访问隐私政策 你可以在注册页面，查看本APP隐私政策的全部内容。
    </view>
    <view>
      （六）停止运营向你告知
      如我们停止运营，我们将及时停止收集你个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知你，并对所持有的你的个人信息进行删除或匿名化处理。
    </view>

    <view>八、未成年人的个人信息保护</view>
    <view
      >Get一下非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用Get一下服务前，应事先取得您家长或法定监护人的书面同意。Get一下根据国家相关法律法规的规定保护未成年人的个人信息。</view
    >
    <view>九、通知和修订</view>
    <view
      >1、为给您提供更好的服务，Get一下的业务将不时变化，本隐私政策也将随之调整。Get一下会通过在Get一下网站、移动端上发出更新版本并提醒您相关内容的更新，也请您访问Get一下以便及时了解最新的隐私政策。</view
    >
    <view
      >2、如果您对于本隐私政策或在使用Get一下服务时对于您的个人信息或隐私情况有任何问题，请联系Get一下客服热线（联系电话：
      0731-82519989 ,电子邮箱： fawu@tanzhou.net ）并作充分描述，我们将尽力解决。
    </view></view
  >
</template>

<script>
export default {
  methods: {
    goSdk() {
      uni.navigateTo({ url: '/pages/sdkDetail/index' });
    },
  },
};
</script>

<style lang="scss" scoped>
.privacy-policy {
  height: 100vh;
  padding: 15px;
  font-size: 12px;
  font-family: PingFangSC, PingFangSC-Regular;
  font-weight: 400;
  text-align: justify;
  color: #161413;
  line-height: 16px;
  background-color: #f8f8f8;
  user-select: auto;
}
.btn {
  color: blue;
}
.sdk-detail {
  padding: 0 0 10px 0;
  // font-size: 14px;
  color: #161413;
  // background-color: #f8f8f8;
  overflow-x: hidden;
  word-break: break-all;
  .line {
    margin: 5px 0;
    width: 100%;
    height: 1px;
    background-color: #f1f1ed;
  }
  .h3 {
    margin: 10px 0;
  }
}
</style>
