<template>
  <view class="user-agreement" :selectable="true">
    <view>请仔细阅读并同意以下get一下社区用户协议： </view>
    <view> 一、关于get一下社区服务条款的说明</view>
    <view>（一）服务条款的接受</view>
    <view
      >get一下社区的所有权和运营权归get一下社区所有。get一下社区将依照本协议及其随时发布的相关规则或说明提供社区服务。本协议所指的社区服务的具体内容由get一下社区根据实际情况提供，包括发帖、评论、回复、内容等所有潭get一下社区为用户提供的网络服务。
      在您使用get一下社区服务前请确认并仔细阅读本协议。当您点选同意或定制、使用、接受get一下社区服务时即视为您已仔细阅读本协议，同意接受本服务条款的所有规范包括接受get一下社区对服务条款随时所做的任何修改和补充，并愿受其约束。</view
    >
    <view>（二）服务条款的修改与变更</view>
    <view
      >get一下社区有权随时对服务条款进行修改，有权随时变更、中断或终止部分或全部网络服务，并不需对用户或任何第三方负责和为此承担任何责任。
      修改后的服务条款一旦公布即有效代替原来的服务条款。您可随时登录get一下社区查阅最新版服务条款。get一下社区有权随时发布与该服务相关的规则或说明，这些规则或说明均构成本服务条款的一部分。
      用户如果不同意服务条款的修改，可以主动取消已经获得的网络服务；如果用户继续使用网络服务，则视为用户已经接受服务条款的修改。</view
    >
    <view>二、关于get一下社区的使用规则</view>
    <view>（一）用户应遵守以下法律及法规</view>
    <view
      >1、用户应遵守中华人民共和国有关法律、法规，承担一切因您的行为直接或间接引起的法律责任。在任何情况下，get一下社区认为用户的行为可能违反国家法律、法规，可以在任何时候不经事先通知终止向该用户提供服务。</view
    >
    <view>2、用户如不在国内居住，还应特别注意遵守所在国家和地区所有有关的法律和法规。</view>
    <view>（二）关于用户名的管理</view>
    <view
      >1、请勿以党和国家领导人或其他名人的真实姓名、字、号、艺名、笔名、头衔等注册和使用昵称（如确为本人，需要提交相关证据并通过审核方可允许使用）；</view
    >
    <view
      >2、请勿以国家组织机构或其他组织机构的名称等注册和使用昵称（如确为该机构，需要提交相关证据并通过审核方可允许使用）；</view
    >
    <view>3、请勿注册和使用与其他网友相同、相仿的名字或昵称；</view>
    <view>4、请勿注册和使用不文明、不健康的ID和昵称；</view>
    <view>5、请勿注册和使用易产生歧义、引起他人误解或带有各种奇形怪状符号的ID和昵称。</view>
    <view>（三）个人资料提供：</view>
    <view>1、在注册时，用户应该提供真实、准确、最新和完整的个人资料；</view>
    <view>2、如个人资料有任何变动，用户必须及时更新相关信息。</view>
    <view>（四）用户帐号、密码安全和信息存储</view>
    <view
      >1、用户一旦注册成功，便成为get一下社区的正式用户，将得到一个密码和帐号。用户有义务保证密码和帐号的安全。每个用户应当对以其用户名进行的所有活动和事件承担全部责任,包括所产生的任何损失或损害。</view
    >
    <view
      >2、用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用或存在其它安全问题等情况，应立即通知get一下社区管理员。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，get一下社区不承担任何责任。</view
    >
    <view
      >如用户违反相关法律法规和本协议各项规定，get一下社区有权不经通知删除该帐号，并停止为该用户提供相关网络服务。</view
    >
    <view>3、因网络的特殊性和不稳定性，get一下社区不对用户所发布信息的删除或储存失败承担任何责任。</view>
    <view>（五）get一下社区禁止的行为</view>
    <view
      >用户在get一下社区发布信息时，必须遵守国家有关法律规定，并承担一切因自己发布信息不当导致的民事、行政或刑事法律责任。用户在get一下社区所发布的信息，不得含有以下内容：</view
    >
    <view>1、违反宪法所确定的基本原则的；含有法律、行政法规禁止的其他内容的；</view>
    <view>2、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</view>
    <view>3、损害国家荣誉和利益的，攻击党和政府及其领导人的；</view>
    <view>4、煽动民族仇恨、民族歧视，破坏民族团结的；</view>
    <view>5、煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的，以非法民间组织名义活动的；</view>
    <view>6、破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
    <view>7、散布谣言或不实消息，扰乱社会秩序，破坏社会稳定的；</view>
    <view>8、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
    <view> 9、违背中华民族传统美德、社会公德、伦理道德、以及社会主义精神文明的；</view>
    <view>10、宣扬种族歧视，破坏国家、民族、地区团结的言论和消息的；</view>
    <view>11、侵犯他人肖像权、姓名权、名誉权、隐私权或其他人身权利的；</view>
    <view>12、恶意重复、大量发布各种信息的；</view>
    <view>13、未经get一下社区同意，张贴任何形式广告的；</view>
    <view
      >14、利用本服务进行故意制作、传播计算机病毒等破坏性程序，或针对本服务、与本服务连接的服务器或网络制造干扰、混乱的；</view
    >
    <view
      >15、发布信息时，任何人不得以任何原因对任何一位用户或公民进行人身攻击、侮辱、谩骂、诋毁、中伤、恐吓等，不得侵害他人合法权益；</view
    >
    <view
      >16、您制作、发布、传播的内容需遵守《网络音视频信息服务管理规定》及相关法律法规规定，不得利用基于深度学习、虚拟现实等的新技术新应用制作、发布、传播虚假新闻信息。您在发布或传播利用基于深度学习、虚拟现实等的新技术新应用制作的非真实音视频信息时，应当以显著方式予以标识。</view
    >
    <view
      >17、如用户在get一下社区发布信息时，不能履行和遵守协议中的规定，本网站有权修改、删除用户发布的任何信息，并有权对违反协议的用户做出封禁ID，或暂时、永久禁止在本网站发布信息的处理，同时保留依法追究当事人法律责任的权利，get一下社区的系统记录将作为用户违反法律的证据。</view
    >
    <view>三、关于社区用户的隐私权</view>
    <view
      >用户在遵守上述协议的前提下，get一下社区将充分保护用户享有个人隐私。get一下社区会对用户的个人信息严格保密，不会在未经用户合法授权时，公开、编辑或透露其个人信息及保存在get一下社区中的非公开内容，下列情况除外：</view
    >
    <view>1、违反相关法律法规或get一下社区务协议规定；</view>
    <view>2、按照相关政府主管部门的要求，有必要向相关法律部门提供备案的内容；</view>
    <view>3、维护社会个体和公众的权利、财产或人身安全；</view>
    <view>4、被侵害的第三人提出权利主张；</view>
    <view>5、为维护用户及社会公共利益的需要；</view>
    <view>6、维护本网站的合法权益；</view>
    <view>7、事先获得用户的明确授权；</view>
    <view>8、符合其它相关的要求。</view>
    <view>四、关于get一下社区的知识产权及其他相关权利</view>
    <view
      >1、对于用户上传到get一下社区上可公开获取区域的任何内容，用户同意授予get一下社区在本社区范围内永久性的、不可撤销的、免费的、非独家的和再许可的权利和许可，get一下社区可以使用、复制、修改、改编此等内容的全部或部分，和将此等内容的全部或部分在社区内以多种方式进行发布、加精处理等。</view
    >
    <view
      >2、get一下社区的文字、软件、声音、图片、设计图样等及在邮件信息、广告中的全部内容和标识包括“get一下社区”及相关图形标识，均受版权、商标和专利等其它财产所有权法律的保护。所以，未经get一下社区或相关权利人授权许可，不能擅自复制、发布、转载、播放、改编、汇编或以其它方式使用这些内容或将该内容用于其它任何商业目的。</view
    >
    <view
      >3、用户必须保证，上传的照片、文字、音乐以及视频等作品之著作权已获得合法授权，在本网站之上传行为未侵犯任何第三方之合法权益。否则，将由该用户承担由此引起的一切法律责任；用户不得将任何内部资料、机密资料、涉及他人隐私资料或侵犯任何人的专利、商标、著作权、商业秘密或其他专属权利之内容加以上载、张贴、或以其它方式传送。</view
    >
    <view>五、免责声明</view>
    <view>
      1、本服务涉及到互联网及移动通讯等服务，可能会受到各个环节不稳定因素的影响。因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、GSM网络、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。使用本服务的用户须承担以上风险，get一下社区对服务之及时性、安全性、准确性不作担保，对因此导致用户不能发送和接受阅读消息、或传递错误，个人设定之时效、未予储存或其它问题不承担任何责任。对于不可抗力或非get一下社区过错原因导致的用户数据损失、丢失或服务停止，get一下社区将不承担任何责任。</view
    >
    <view
      >2、get一下社区无法对用户的使用行为进行全面控制，因此对用户不作任何类型的担保。用户同意对get一下社区的使用承担全部风险。用户使用经由本服务下载的或取得的任何资料、信息而导致该用户电脑系统损坏或资料流失，其风险自行负担。</view
    >
    <view
      >3、get一下社区内设有通往其他网站和网页的链接，但这些网站和网页并非由get一下社区经营或控制，get一下社区对其正确性、合法性、正当性不负任何责任。用户启动任何此类链接或网页，离开get一下社区进入其他网站或网页，所有风险自负；因使用或依赖上述网站或资源所产生的损失或损害，get一下社区不承担任何责任。</view
    >
    <view
      >4、用户同意保障和维护get一下社区及其他用户的利益，如用户使用该服务导致get一下社区或任何其他第三人造成损失等，用户同意承担一切责任。get一下社区对用户使用网络服务所产生的任何直接、间接、偶然、特殊及继起的损害不负任何责任。</view
    >
    <view
      >5、用户在get一下社区内上传、发布、展示的信息或作品（包括但不限于文字、图片、音视频等）违反相关法律规定或侵犯第三方合法权益的，用户同意承担一切责任，get一下社区不承担任何责任。</view
    >
    <view
      >6、第三方以任何方式进行的使用、修改、演绎、下载或转载信息等可能侵害用户权益的行为get一下社区均不承担任何责任。</view
    >
    <view>六、服务的终止</view>
    <view
      >1、对于违反get一下社区服务条款或其他get一下社区认为有必要的情况，get一下社区有权在任何时候终止用户的帐号、密码或使用本服务，或删除、转移用户存储、发布在get一下社区的内容。</view
    >
    <view
      >2、get一下社区有权在任何时候，暂时或永久收回、修改或终止包括但不限于用户通过本网站注册的二级域名和使用空间等各种资源。</view
    >
    <view> 3、get一下社区有权在采取上述行为时不事先通知用户，并且对用户和任何第三人不承担任何责任。</view>
    <view
      >七、本服务条款的订立、执行和解释及争议的解决均应适用中国法律,
      如服务条款之任何一部分与中华人民共和国法律相抵触，则该部分条款应按法律规定重新解释。本服务条款和get一下社区的其它相关规则或说明构成完整的协议，本社区有权进一步修改本协议，本协议的最终解释权归get一下社区所有。用户和get一下社区一致同意凡因本服务所产生的纠纷双方应协商解决。若协商不成，任何一方可提交get一下社区所在地法院诉讼裁决。</view
    >
  </view>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
.user-agreement {
  height: 100vh;
  padding: 15px;
  font-size: 12px;
  font-family: PingFangSC, PingFangSC-Regular;
  font-weight: 400;
  text-align: justify;
  color: #161413;
  line-height: 16px;
  background-color: #f8f8f8;
  user-select: auto;
}
</style>
